## Plan Result (prod-cftapps_cluster_lb_backend_arm_tf)




<pre><code>Plan: 1 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_private_dns_a_record.appgw[&#34;sscs-hearings-api-prod&#34;]
* Update
  * module.app-gw.azurerm_application_gateway.ag[1]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_private_dns_a_record.appgw["sscs-hearings-api-prod"] will be created
  + resource "azurerm_private_dns_a_record" "appgw" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sscs-hearings-api-prod"
      + records             = [
          + "10.90.96.21",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "service.core-compute-prod.internal"
    }

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.app-gw.azurerm_application_gateway.ag[1] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw"
        name                = "aks01-prod-agw"
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (4 unchanged attributes hidden)

      + backend_address_pool {
          + ip_addresses = [
              + "10.90.79.250",
              + "10.90.95.250",
            ]
          + name         = "sscs-hearings-api"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + name                                = "sscs-hearings-api"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_name                          = "sscs-hearings-api"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }

      + http_listener {
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_name             = "http"
          + host_name                      = "sscs-hearings-api-prod.service.core-compute-prod.internal"
          + name                           = "sscs-hearings-api"
          + protocol                       = "Http"
        }

      + probe {
          + host                                      = "sscs-hearings-api-prod.service.core-compute-prod.internal"
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "sscs-hearings-api"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }

      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendAddressPools/am-judicial-booking-service" -> null
          - backend_address_pool_name  = "am-judicial-booking-service" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendHttpSettingsCollection/am-judicial-booking-service" -> null
          - backend_http_settings_name = "am-judicial-booking-service" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/httpListeners/am-judicial-booking-service" -> null
          - http_listener_name         = "am-judicial-booking-service" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/requestRoutingRules/am-judicial-booking-service" -> null
          - name                       = "am-judicial-booking-service" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendAddressPools/am-judicial-booking-service"
          + backend_address_pool_name  = "am-judicial-booking-service"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendHttpSettingsCollection/am-judicial-booking-service"
          + backend_http_settings_name = "am-judicial-booking-service"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/httpListeners/am-judicial-booking-service"
          + http_listener_name         = "am-judicial-booking-service"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/requestRoutingRules/am-judicial-booking-service"
          + name                       = "am-judicial-booking-service"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendAddressPools/et-cos" -> null
          - backend_address_pool_name  = "et-cos" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendHttpSettingsCollection/et-cos" -> null
          - backend_http_settings_name = "et-cos" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/httpListeners/et-cos" -> null
          - http_listener_name         = "et-cos" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/requestRoutingRules/et-cos" -> null
          - name                       = "et-cos" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendAddressPools/et-cos"
          + backend_address_pool_name  = "et-cos"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendHttpSettingsCollection/et-cos"
          + backend_http_settings_name = "et-cos"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/httpListeners/et-cos"
          + http_listener_name         = "et-cos"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/requestRoutingRules/et-cos"
          + name                       = "et-cos"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendAddressPools/et-msg-handler" -> null
          - backend_address_pool_name  = "et-msg-handler" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendHttpSettingsCollection/et-msg-handler" -> null
          - backend_http_settings_name = "et-msg-handler" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/httpListeners/et-msg-handler" -> null
          - http_listener_name         = "et-msg-handler" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/requestRoutingRules/et-msg-handler" -> null
          - name                       = "et-msg-handler" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendAddressPools/et-msg-handler"
          + backend_address_pool_name  = "et-msg-handler"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendHttpSettingsCollection/et-msg-handler"
          + backend_http_settings_name = "et-msg-handler"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/httpListeners/et-msg-handler"
          + http_listener_name         = "et-msg-handler"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/requestRoutingRules/et-msg-handler"
          + name                       = "et-msg-handler"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendAddressPools/et-sya-api" -> null
          - backend_address_pool_name  = "et-sya-api" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendHttpSettingsCollection/et-sya-api" -> null
          - backend_http_settings_name = "et-sya-api" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/httpListeners/et-sya-api" -> null
          - http_listener_name         = "et-sya-api" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/requestRoutingRules/et-sya-api" -> null
          - name                       = "et-sya-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendAddressPools/et-sya-api"
          + backend_address_pool_name  = "et-sya-api"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendHttpSettingsCollection/et-sya-api"
          + backend_http_settings_name = "et-sya-api"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/httpListeners/et-sya-api"
          + http_listener_name         = "et-sya-api"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/requestRoutingRules/et-sya-api"
          + name                       = "et-sya-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendAddressPools/ia-bail-case-api" -> null
          - backend_address_pool_name  = "ia-bail-case-api" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendHttpSettingsCollection/ia-bail-case-api" -> null
          - backend_http_settings_name = "ia-bail-case-api" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/httpListeners/ia-bail-case-api" -> null
          - http_listener_name         = "ia-bail-case-api" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/requestRoutingRules/ia-bail-case-api" -> null
          - name                       = "ia-bail-case-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendAddressPools/ia-bail-case-api"
          + backend_address_pool_name  = "ia-bail-case-api"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendHttpSettingsCollection/ia-bail-case-api"
          + backend_http_settings_name = "ia-bail-case-api"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/httpListeners/ia-bail-case-api"
          + http_listener_name         = "ia-bail-case-api"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/requestRoutingRules/ia-bail-case-api"
          + name                       = "ia-bail-case-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendAddressPools/plum-recipe-backend" -> null
          - backend_address_pool_name  = "plum-recipe-backend" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendHttpSettingsCollection/plum-recipe-backend" -> null
          - backend_http_settings_name = "plum-recipe-backend" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/httpListeners/plum-recipe-backend" -> null
          - http_listener_name         = "plum-recipe-backend" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/requestRoutingRules/plum-recipe-backend" -> null
          - name                       = "plum-recipe-backend" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendAddressPools/plum-recipe-backend"
          + backend_address_pool_name  = "plum-recipe-backend"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendHttpSettingsCollection/plum-recipe-backend"
          + backend_http_settings_name = "plum-recipe-backend"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/httpListeners/plum-recipe-backend"
          + http_listener_name         = "plum-recipe-backend"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/requestRoutingRules/plum-recipe-backend"
          + name                       = "plum-recipe-backend"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendAddressPools/ts-translation-service" -> null
          - backend_address_pool_name  = "ts-translation-service" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendHttpSettingsCollection/ts-translation-service" -> null
          - backend_http_settings_name = "ts-translation-service" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/httpListeners/ts-translation-service" -> null
          - http_listener_name         = "ts-translation-service" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/requestRoutingRules/ts-translation-service" -> null
          - name                       = "ts-translation-service" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendAddressPools/ts-translation-service"
          + backend_address_pool_name  = "ts-translation-service"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendHttpSettingsCollection/ts-translation-service"
          + backend_http_settings_name = "ts-translation-service"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/httpListeners/ts-translation-service"
          + http_listener_name         = "ts-translation-service"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/requestRoutingRules/ts-translation-service"
          + name                       = "ts-translation-service"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sscs-hearings-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sscs-hearings-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sscs-hearings-api"
          + id                         = (known after apply)
          + name                       = "sscs-hearings-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

        # (38 unchanged blocks hidden)
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label prod-cftapps_cluster_lb_backend_arm_tf/add-or-update: POST https://api.github.com/repos/hmcts/azure-platform-terraform/issues/1313/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":1313,"Program":"tfcmt","SHA1":"","Target":"prod-cftapps_cluster_lb_backend_arm_tf","Vars":{}} -->